let num = prompt("Введіть число с 1 по 12:");

if (num >= 1 && num < 3 || num == 12){
    alert("Ви ввели число " + num + " , а це означає що пора року Зима")
}
else if (num >= 3 && num < 6){
    alert("Ви ввели число " + num + " , а це означає що пора року Весна")
}
else if (num >= 6 && num < 9){
    alert("Ви ввели число " + num + " , а це означає що пора року Літо")
}
else if (num >= 9 && num <= 11){
    alert("Ви ввели число " + num + " , а це означає що пора року Осінь")
}
else{
    alert("Ви щось неправильно зробили!")
}